---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTooShort
source: html/1d394b24-af0b-f2c9-eda9-6c317d5d9a18.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomTooShort Property

[Room] is very short. If this is not intended, change its Upper Limit and Offset.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomTooShort { get; }
```